DataProcessors/Renault_ВыгрузкаОстаткаРеноПартс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ВыгрузкаОстаткаРеноПартс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_НастройкиОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НастройкиОбменаССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагСуммирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КаталогРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КаталогРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехСемья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Габариты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеВSAPе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодоваяЗапчасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PVI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыPVI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЗаменыРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗаменыРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТарифЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаТарифа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СкидкиОптовыеПокупатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СкидкиОптовыеПокупатели</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ГруппыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ВыгрузкаОстаткаРеноПартс/Ext/ObjectModule.bsl
Процедура ВыполнитьВыгрузку () Экспорт 

    ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.Выбрать();

    Пока ДилерскийЦентр.Следующий() Цикл

        ТаблицаДанных = Новый ТаблицаЗначений;
        ТаблицаДанных.Колонки.Добавить("BIR",                Новый ОписаниеТипов("Строка"));
        ТаблицаДанных.Колонки.Добавить("ItemId",             Новый ОписаниеТипов("Строка"));
        ТаблицаДанных.Колонки.Добавить("QuantityAvailable",  Новый ОписаниеТипов("Строка"));
        ТаблицаДанных.Колонки.Добавить("SubstitutionItemId", Новый ОписаниеТипов("Строка"));
        ТаблицаДанных.Колонки.Добавить("UnitPrice",          Новый ОписаниеТипов("Строка"));
        ТаблицаДанных.Колонки.Добавить("DiscountCode",       Новый ОписаниеТипов("Строка"));

        Основной = Новый Запрос;
        Основной.Текст = "ВЫБРАТЬ
                         |  ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК QuantityAvailable,
                         |  ПОДСТРОКА(ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул, 1, 10) КАК ItemId,
                         |  ПОДСТРОКА(Renault_НастройкиОбменаССайтом.DMD, 1, 8) КАК BIR,
                         |  ЕСТЬNULL(Renault_ТарифЦен.Цена, 0) КАК UnitPrice,
                         |  ПОДСТРОКА(Renault_ЗаменыРеферансов.АртикулЗамены, 1, 10) КАК SubstitutionItemId,
                         |  ЕСТЬNULL(Renault_КаталогРеферансов.КодСкидки, """") КАК DiscountCode
                         |ПОМЕСТИТЬ ВТ_Остатки
                         |ИЗ
                         |  РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
                         |          ,
                         |          СкладКомпании В
                         |              (ВЫБРАТЬ РАЗЛИЧНЫЕ
                         |                  Renault_НастройкиОбменаССайтом.Склад
                         |              ИЗ
                         |                  РегистрСведений.Renault_НастройкиОбменаССайтом КАК Renault_НастройкиОбменаССайтом
                         |              ГДЕ
                         |                  Renault_НастройкиОбменаССайтом.ДилерскийЦентр = &ДилерскийЦентр)) КАК ОстаткиТоваровКомпанииОстатки
                         |      ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
                         |      ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = Renault_КаталогРеферансов.Номенклатура
                         |      ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_НастройкиОбменаССайтом КАК Renault_НастройкиОбменаССайтом
                         |      ПО ОстаткиТоваровКомпанииОстатки.СкладКомпании = Renault_НастройкиОбменаССайтом.Склад
                         |      ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаменыРеферансов КАК Renault_ЗаменыРеферансов
                         |      ПО (&ТекущаяДата >= Renault_ЗаменыРеферансов.ДатаНачала
                         |              ИЛИ Renault_ЗаменыРеферансов.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
                         |          И (&ТекущаяДата <= Renault_ЗаменыРеферансов.ДатаЗавершения
                         |              ИЛИ Renault_ЗаменыРеферансов.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
                         |          И (Renault_ЗаменыРеферансов.АртикулЗамены В
                         |              (ВЫБРАТЬ ПЕРВЫЕ 1
                         |                  Таб.АртикулЗамены
                         |              ИЗ
                         |                  РегистрСведений.Renault_ЗаменыРеферансов КАК Таб
                         |              ГДЕ
                         |                  Таб.АртикулНоменклатуры = ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул))
                         |      ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ТарифЦен КАК Renault_ТарифЦен
                         |      ПО ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул = Renault_ТарифЦен.Артикул
                         |          И (Renault_ТарифЦен.ТипЦены = &ТипЦены)
                         |ГДЕ
                         |  ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток > 0
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |  ВТ_Остатки.BIR,
                         |  ВТ_Остатки.ItemId КАК ItemId,
                         |  СУММА(ВТ_Остатки.QuantityAvailable) КАК QuantityAvailable,
                         |  СРЕДНЕЕ(ВТ_Остатки.UnitPrice) КАК UnitPrice,
                         |  ВТ_Остатки.SubstitutionItemId КАК SubstitutionItemId,
                         |  ВТ_Остатки.DiscountCode КАК DiscountCode
                         |ИЗ
                         |  ВТ_Остатки КАК ВТ_Остатки
                         |
                         |СГРУППИРОВАТЬ ПО
                         |  ВТ_Остатки.BIR,
                         |  ВТ_Остатки.ItemId,
                         |  ВТ_Остатки.SubstitutionItemId,
                         |  ВТ_Остатки.DiscountCode";

        Основной.УстановитьПараметр("ДилерскийЦентр", ДилерскийЦентр.Ссылка);
        Основной.УстановитьПараметр("ТипЦены",        Справочники.Renault_НастройкиПодсистемыЗапчасти.ЭтаБаза.ТипЦенRParts);
        Основной.УстановитьПараметр("ТекущаяДата",    ТекущаяДата());
        Выборка = Основной.Выполнить().Выбрать();

        Пока Выборка.Следующий() Цикл

            СтрокаТЗ = ТаблицаДанных.Добавить();
            СтрокаТЗ.BIR                = Выборка.BIR;
            СтрокаТЗ.SubstitutionItemId = Выборка.SubstitutionItemId;
            СтрокаТЗ.ItemId             = Выборка.ItemId;
            СтрокаТЗ.QuantityAvailable  = Формат(Окр(Выборка.QuantityAvailable), "ЧРД=.; ЧН=0; ЧГ=0");
            СтрокаТЗ.UnitPrice          = Формат(Выборка.UnitPrice, "ЧРД=.; ЧН=0; ЧГ=0");
            СтрокаТЗ.DiscountCode       = Выборка.DiscountCode;

        КонецЦикла;

        мКлючевоеПоле = Новый Массив;
        мКлючевоеПоле.Добавить("BIR");   
        мКлючевоеПоле.Добавить("ItemId"); 
        ВыполнитьDeleteInsertВSQL(ТаблицаДанных, "dbo.A2A_DATA", Справочники.Renault_НастройкиПодключенияКSQL.ТаблицаА2А);

    КонецЦикла;


    // Выгрузка контрагентов /////////////////////////////////////////////////////
    ТаблицаДанных = Новый ТаблицаЗначений;
    ТаблицаДанных.Колонки.Добавить("ID",       Новый ОписаниеТипов("Строка"));
    ТаблицаДанных.Колонки.Добавить("Discount", Новый ОписаниеТипов("Строка"));

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_ОптовыеПокупателиЗапЧастей.Код КАК ID,
                   |    ЕСТЬNULL(Renault_СкидкиОптовыеПокупателиСрезПоследних.Процент, 0) КАК Discount
                   |ИЗ
                   |    Справочник.Renault_ОптовыеПокупателиЗапЧастей КАК Renault_ОптовыеПокупателиЗапЧастей
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СкидкиОптовыеПокупатели КАК Renault_СкидкиОптовыеПокупателиСрезПоследних
                   |        ПО Renault_ОптовыеПокупателиЗапЧастей.ГруппаКонтрагента = Renault_СкидкиОптовыеПокупателиСрезПоследних.ГруппаКонтрагента";

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        Стр = ТаблицаДанных.Добавить();
        Стр.ID = Выборка.ID;
        Стр.Discount = Формат(Выборка.Discount, "ЧРД=.; ЧН=0; ЧГ=0");
    КонецЦикла;

    мКлючевоеПоле = Новый Массив;
    мКлючевоеПоле.Добавить("ID");

    ВыполнитьMergeВSQL(ТаблицаДанных, "dbo.A2A_CUSTOMERS", мКлючевоеПоле, Справочники.Renault_НастройкиПодключенияКSQL.ТаблицаА2А);


    // Выгрузка контрагентов /////////////////////////////////////////////////////
    ТаблицаДанных = Новый ТаблицаЗначений;
    ТаблицаДанных.Колонки.Добавить("Code",      Новый ОписаниеТипов("Строка"));
    ТаблицаДанных.Колонки.Добавить("NDiscount", Новый ОписаниеТипов("Строка"));
    ТаблицаДанных.Колонки.Добавить("UDiscount", Новый ОписаниеТипов("Строка"));

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_СкидкиОптовыеРеферансы.КодСкидки КАК Code,
                   |    Renault_СкидкиОптовыеРеферансы.ПроцентСкладской КАК NDiscount,
                   |    Renault_СкидкиОптовыеРеферансы.ПроцентСрочный КАК UDiscount
                   |ИЗ
                   |    РегистрСведений.Renault_СкидкиОптовыеРеферансы КАК Renault_СкидкиОптовыеРеферансы";

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        Стр = ТаблицаДанных.Добавить();
        Стр.Code = Выборка.Code;
        Стр.NDiscount = Формат(Выборка.NDiscount, "ЧРД=.; ЧН=0; ЧГ=0");
        Стр.UDiscount = Формат(Выборка.UDiscount, "ЧРД=.; ЧН=0; ЧГ=0");
    КонецЦикла;

    мКлючевоеПоле = Новый Массив;
    мКлючевоеПоле.Добавить("Code");

    ВыполнитьMergeВSQL(ТаблицаДанных, "dbo.A2A_DISCOUNTS", мКлючевоеПоле, Справочники.Renault_НастройкиПодключенияКSQL.ТаблицаА2А);

КонецПроцедуры

Функция ПолучитьСтрокуСоединения(Настройки) 

    СтрокаПодключения = "DRIVER="+Настройки.Драйвер +"; SERVER=" + Настройки.АдресСервера+"; DATABASE="+Настройки.БазаДанных+"; Uid="+Настройки.Логин+ "; Pwd="+ Настройки.Пароль+";";

    Возврат СтрокаПодключения; 

КонецФункции

Функция ВыполнитьMergeВSQL(ТаблицаДанных, ИмяТаблицы, мКлючевоеПоле, Параметры)
	Попытка
		Если ТаблицаДанных.Количество()>0 Тогда
			СтрокаПодключения  = ПолучитьСтрокуСоединения(Параметры);
			Ответ = Истина;
			Подключение = Новый COMОбъект("ADODB.Connection");
			query = Новый COMОбъект("ADODB.Stream");
						
			Попытка
				Подключение.open(СтрокаПодключения);
			Исключение
				Инфа = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("error merge to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
				Ответ = Ложь;			
			КонецПопытки;
			query.Open();
			ЭтоПерв = Истина;
			query.WriteText("MERGE INTO "+Параметры.БазаДанных+"."+ИмяТаблицы+" AS Target "+Символы.ПС, 0);
			query.WriteText("USING (VALUES ", 0);
			ЭтоПервДанные = Истина;
			Счетчик = 0;
			Для Каждого Данные Из ТаблицаДанных Цикл
				Счетчик = Счетчик + 1;
				Если ЭтоПервДанные Тогда
					ЭтоПервДанные = Ложь;
				Иначе
					query.WriteText(", "+Символы.ПС, 0);
				КонецЕсли;
				query.WriteText("(", 0);
				ЭтоПервКолонка = истина;
				Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
					Если ЭтоПервКолонка Тогда
						ЭтоПервКолонка = Ложь;
					Иначе
						query.WriteText(", ", 0);
					КонецЕсли;
					СтрокаВставки = Данные[Кол.Имя];
					Если ТипЗнч(СтрокаВставки) =  Тип("Строка") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,3);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Число") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),0);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Дата") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,1);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Булево") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,4);
                    Иначе
						СтрокаВставки = ДанныеВЗапрос(Строка(СтрокаВставки),2);
                    КонецЕсли;
                    					
					query.WriteText(СтрокаВставки, 0);		
								
				КонецЦикла;
				query.WriteText(")", 0);
				//ЗапросКБазе = ЗапросКБазе + "('"+Данные.VIN+"',"+ДанныеВАфм(Данные.DistrDate,1)+", "+ДанныеВАфм(Данные.BIR_Invoice,2)+")";

				Если Счетчик > 100 Тогда
					
					query.WriteText(") AS Source (", 0);
					ЭтоПервКолонка = Истина;
					Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
						Если ЭтоПервКолонка Тогда
							ЭтоПервКолонка = ложь;
						Иначе
							query.WriteText(", ", 0);
						КонецЕсли;
						query.WriteText("New"+Кол.Имя, 0);
					КонецЦикла;
					query.WriteText(") "+Символы.ПС, 0);
					ЭтоПервоеКлючПоле = Истина;
					Для Каждого сКлючевоеПоле из мКлючевоеПоле Цикл
						Если ЭтоПервоеКлючПоле Тогда
							ЭтоПервоеКлючПоле = ложь;
							query.WriteText("ON ", 0);
						Иначе
							query.WriteText("and ", );
						КонецЕсли;
						query.WriteText(" Target."+сКлючевоеПоле+" = Source.New"+сКлючевоеПоле+" "+Символы.ПС, 0);
					КонецЦикла;
					query.WriteText("WHEN MATCHED THEN "+Символы.ПС+"UPDATE SET ", 0);
					ЭтоПервКолонка = Истина;
					Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
						ЭтоКлючевоеПоле = мКлючевоеПоле.Найти(Кол.Имя);
						Если ЭтоКлючевоеПоле <> Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						Если ЭтоПервКолонка Тогда
							ЭтоПервКолонка = ложь;
						Иначе
							query.WriteText(", ", 0);
						КонецЕсли;
						query.WriteText(Кол.Имя+ " = Source.New"+Кол.Имя, 0);
					КонецЦикла;
					query.WriteText(Символы.ПС+"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+"INSERT ( ", 0);
					ЭтоПервКолонка = Истина;
					Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
						Если ЭтоПервКолонка Тогда
							ЭтоПервКолонка = ложь;
						Иначе
							query.WriteText(", ", 0);
						КонецЕсли;
						query.WriteText(Кол.Имя, 0);
						
					КонецЦикла;
					query.WriteText(") VALUES ( ", 0);
					ЭтоПервКолонка = Истина;
					Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
						Если ЭтоПервКолонка Тогда
							ЭтоПервКолонка = ложь;
						Иначе
							query.WriteText(", ", 0);
						КонецЕсли;
						query.WriteText("New"+Кол.Имя, 0);
						
					КонецЦикла;
					query.WriteText(");", 0);
					//"UPDATE SET DistrDate = Source.NewDistrDate, BIR_Invoice=  Source.NewBIR_Invoice "+Символы.ПС+
					//"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+
					//"INSERT (VIN, DistrDate,BIR_Invoice) VALUES (NewVIN, NewDistrDate,NewBIR_Invoice);";
					
					Попытка
						query.Position = 0;
						Подключение.Execute(query.readText());
					Исключение
						Инф = ИнформацияОбОшибке();
						ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки()+ символы.ПС;
						ЗаписьЖурналаРегистрации("error merge to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
					КонецПопытки;
					
					query.Close();
					
					query.Open();
					ЭтоПерв = Истина;
					query.WriteText("MERGE INTO "+Параметры.БазаДанных+"."+ИмяТаблицы+" AS Target "+Символы.ПС, 0);
					query.WriteText("USING (VALUES ", 0);
					ЭтоПервДанные = Истина;
					Счетчик = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			//ЗапросКБазе= ЗапросКБазе +") AS Source (NewVIN, NewDistrDate,NewBIR_Invoice) "+Символы.ПС;
			query.WriteText(") AS Source (", 0);
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					query.WriteText(", ", 0);
				КонецЕсли;
				query.WriteText("New"+Кол.Имя, 0);
			КонецЦикла;
			query.WriteText(") "+Символы.ПС, 0);
			ЭтоПервоеКлючПоле = Истина;
			Для Каждого сКлючевоеПоле из мКлючевоеПоле Цикл
				Если ЭтоПервоеКлючПоле Тогда
					ЭтоПервоеКлючПоле = ложь;
					query.WriteText("ON ", 0);
				Иначе
					query.WriteText("and ", );
				КонецЕсли;
				query.WriteText(" Target."+сКлючевоеПоле+" = Source.New"+сКлючевоеПоле+" "+Символы.ПС, 0);
			КонецЦикла;
			query.WriteText("WHEN MATCHED THEN "+Символы.ПС+"UPDATE SET ", 0);
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				ЭтоКлючевоеПоле = мКлючевоеПоле.Найти(Кол.Имя);
				Если ЭтоКлючевоеПоле <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					query.WriteText(", ", 0);
				КонецЕсли;
				query.WriteText(Кол.Имя+ " = Source.New"+Кол.Имя, 0);
			КонецЦикла;
            query.WriteText(Символы.ПС+"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+"INSERT ( ", 0);
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					query.WriteText(", ", 0);
				КонецЕсли;
				query.WriteText(Кол.Имя, 0);
				
			КонецЦикла;
            query.WriteText(") VALUES ( ", 0);
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = ложь;
				Иначе
					query.WriteText(", ", 0);
				КонецЕсли;
				query.WriteText("New"+Кол.Имя, 0);
				
			КонецЦикла;
            query.WriteText(");", 0);
			//"UPDATE SET DistrDate = Source.NewDistrDate, BIR_Invoice=  Source.NewBIR_Invoice "+Символы.ПС+
			//"WHEN NOT MATCHED BY TARGET THEN "+Символы.ПС+
			//"INSERT (VIN, DistrDate,BIR_Invoice) VALUES (NewVIN, NewDistrDate,NewBIR_Invoice);";
				   
			Попытка
				query.Position = 0;
				Подключение.Execute(query.readText());
				Возврат Истина; 
			Исключение
				Инф = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки()+ символы.ПС;
				ЗаписьЖурналаРегистрации("error merge to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
				Возврат Ложь;
			КонецПопытки;
			Возврат Ложь;
		КонецЕсли;	
	Исключение
		Инф = ИнформацияОбОшибке();
		ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("error merge to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьDeleteInsertВSQL(ТаблицаДанных, ИмяТаблицы, Параметры)
	
	Попытка
		Если ТаблицаДанных.Количество() > 0 Тогда
			
			СтрокаПодключения  = ПолучитьСтрокуСоединения(Параметры);
			Ответ = Истина;
			Подключение = Новый COMОбъект("ADODB.Connection");
			query       = Новый COMОбъект("ADODB.Stream");
						
			Попытка
				Подключение.open(СтрокаПодключения);
			Исключение
				Инфа = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("error insert to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
				Ответ = Ложь;			
			КонецПопытки;
			
			query.Open();
			
			// Удаляем старые данные из таблицы
			query.WriteText("DELETE FROM " + Параметры.БазаДанных + "." + ИмяТаблицы + ";" + Символы.ПС, 0);
			
			ЭтоПерв = Истина;
			
			query.WriteText("INSERT INTO " + Параметры.БазаДанных + "." + ИмяТаблицы + "(", 0);
			
			// Заполняем колонки
			ЭтоПервКолонка = Истина;
			Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
				Если ЭтоПервКолонка Тогда
					ЭтоПервКолонка = Ложь;
				Иначе
					query.WriteText(", ", 0);
				КонецЕсли;
				query.WriteText(Кол.Имя, 0);
			КонецЦикла;
			query.WriteText(") " + Символы.ПС, 0);
			
			query.WriteText("VALUES " + Символы.ПС, 0);
			
			// Заполняем значения
			
			Счетчик = 0;
			ЭтоПервДанные = Истина;
			Для Каждого Данные Из ТаблицаДанных Цикл
				Счетчик = Счетчик + 1;
				Если ЭтоПервДанные Тогда
					ЭтоПервДанные = Ложь;
				Иначе
					query.WriteText(", " + Символы.ПС, 0);
				КонецЕсли;
				query.WriteText("(", 0);
				ЭтоПервКолонка = истина;
				Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
					Если ЭтоПервКолонка Тогда
						ЭтоПервКолонка = Ложь;
					Иначе
						query.WriteText(", ", 0);
					КонецЕсли;
					СтрокаВставки = Данные[Кол.Имя];
					Если ТипЗнч(СтрокаВставки) =  Тип("Строка") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,3);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Число") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрЗаменить(СтрокаВставки,Символы.НПП,""),0);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Дата") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,1);
					ИначеЕсли  ТипЗнч(СтрокаВставки) =  Тип("Булево") Тогда
						СтрокаВставки = ДанныеВЗапрос(СтрокаВставки,4);
                    Иначе
						СтрокаВставки = ДанныеВЗапрос(Строка(СтрокаВставки),2);
                    КонецЕсли;
                    					
					query.WriteText(СтрокаВставки, 0);		
								
				КонецЦикла;
				query.WriteText(")", 0);
				
				Если Счетчик = 999 Тогда // Лимит в тысячу
					
					query.WriteText(";" + Символы.ПС, 0);
					
					query.WriteText("INSERT INTO " + Параметры.БазаДанных + "." + ИмяТаблицы + "(", 0);
					
					// Заполняем колонки
					ЭтоПервКолонка = Истина;
					Для Каждого Кол Из ТаблицаДанных.Колонки Цикл
						Если ЭтоПервКолонка Тогда
							ЭтоПервКолонка = Ложь;
						Иначе
							query.WriteText(", ", 0);
						КонецЕсли;
						query.WriteText(Кол.Имя, 0);
					КонецЦикла;
					query.WriteText(") " + Символы.ПС, 0);
					
					query.WriteText("VALUES " + Символы.ПС, 0);
					
					Счетчик = 0;
					ЭтоПервДанные = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				query.Position = 0;
				Подключение.Execute(query.readText());
				Возврат Истина; 
			Исключение
				Инф = ИнформацияОбОшибке();
				ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки()+ символы.ПС;
				ЗаписьЖурналаРегистрации("error insert to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
				Возврат Ложь;
			КонецПопытки;
			Возврат Ложь;
		КонецЕсли;	
	Исключение
		Инф = ИнформацияОбОшибке();
		ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("error insert to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции


Функция ДанныеВЗапрос(ТекЗначение, ТипЗ = 0)
	Если ТипЗ = 1 тогда //Дата , либо нулл
		Если Год(ТекЗначение) = 1 Тогда
			Возврат "NULL";
		Иначе
			Возврат "'" + Формат(ТекЗначение, "ДФ=""гггг-ММ-дд ЧЧ:мм:сс.000""") + "'";
		КонецЕсли;
	ИначеЕсли ТипЗ = 2 Тогда //Строка Либо Нул вместо пустой
		Если СтрДлина(ТекЗначение) = 0 Тогда
			Возврат "NULL";
		Иначе
			Возврат "'" + ТекЗначение + "'"; 
		КонецЕсли;
	ИначеЕсли ТипЗ = 3 Тогда //Строка 
		Возврат "'" + ТекЗначение + "'"; 
	ИначеЕсли ТипЗ = 4 Тогда //Булево
		Если ТекЗначение = Истина Тогда
			Возврат "'" + "ИСТИНА" + "'";
		Иначе
			Возврат "'" + "ЛОЖЬ" + "'";
		КонецЕсли;
	Иначе
		Возврат ТекЗначение;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьЛог() Экспорт

    Параметры = Справочники.Renault_НастройкиПодключенияКSQL.ТаблицаА2А;

    СтрокаПодключения  = ПолучитьСтрокуСоединения(Параметры);
    Ответ = Истина;
    Подключение = Новый COMОбъект("ADODB.Connection");

    Попытка
        Подключение.open(СтрокаПодключения);
    Исключение
        Инфа = ИнформацияОбОшибке();
        ТекстСообщения = "" + ТекущаяДата() + " Connection error: " + ОписаниеОшибки();
        ЗаписьЖурналаРегистрации("error insert to sql", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
        Ответ = Ложь;
    КонецПопытки;

    Кол = ?(ЗначениеЗаполнено(ЭтотОбъект.КоличествоЗаписей), ЭтотОбъект.КоличествоЗаписей, 10);

    Результат = Подключение.Execute("SELECT TOP " + Формат(Кол, "ЧГ=") + " * FROM A2A_SERVICE_LOG ORDER BY [CURRENT_DATE] DESC");

    ТекДок = Новый ТекстовыйДокумент;

    Пока Результат.EOF() = 0 Цикл
        ТекДок.ДобавитьСтроку(""   + Результат.Fields.Item(0).Value +
                              ", " + Результат.Fields.Item(1).Value +
                              ", " + Результат.Fields.Item(2).Value +
                              ", " + Результат.Fields.Item(3).Value +
                              ", " + Результат.Fields.Item(4).Value +
                              ", " + Результат.Fields.Item(5).Value);
        Результат.MoveNext();
    КонецЦикла;

    ТекДок.Показать();

КонецФункции

Функция ОчиститьЛог() Экспорт

    Параметры = Справочники.Renault_НастройкиПодключенияКSQL.ТаблицаА2А;

    СтрокаПодключения  = ПолучитьСтрокуСоединения(Параметры);
    Ответ = Истина;
    Подключение = Новый COMОбъект("ADODB.Connection");

    Попытка
        Подключение.open(СтрокаПодключения);
    Исключение
        Инфа = ИнформацияОбОшибке();
        ТекстСообщения = ""+ТекущаяДата()+" Connection error: "+ОписаниеОшибки();
        ЗаписьЖурналаРегистрации("error insert to sql", УровеньЖурналаРегистрации.Ошибка, ,,ТекстСообщения);
        Ответ = Ложь;
    КонецПопытки;

    Результат = Подключение.Execute("TRUNCATE TABLE A2A_SERVICE_LOG");

КонецФункции
